app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "student_courses".* FROM "student_courses" WHERE "student_courses"."class_id" = ?  ORDER BY "student_courses"."id" ASC LIMIT 1000  [["class_id", "CS105"]]
---
  def get_students
    @course = Course.find(params[:id])
    @student_courses = StudentCourse.where(class_id: @course.class_id).find_each

SELECT  "student_courses".* FROM "student_courses" WHERE "student_courses"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "student_courses" WHERE "student_courses"."id" = ?  [["id", 6]]
---
  def delete_student
    @student_course = StudentCourse.find(params[:id])
    @student_course.delete

INSERT INTO "courses" ("class_id", "class_name", "starting_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["class_id", "SB1"], ["class_name", "Computer Architecture"], ["starting_date", "2015-12-12"], ["created_at", "2015-07-25 08:48:41.383607"], ["updated_at", "2015-07-25 08:48:41.383607"]]
---
  def create
    @course = Course.new(course_params)

    if @course.save