app/controllers/students_controller.rb

INSERT INTO "student_courses" ("student_id", "class_id", "student_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["student_id", "JP001"], ["class_id", "CS301"], ["student_name", "Jimmy"], ["created_at", "2015-07-26 07:43:51.837067"], ["updated_at", "2015-07-26 07:43:51.837067"]]
---
  def add_student
    @student_course = StudentCourse.new(student_params)

    if @student_course.save